# Titanic Dataset:
https://www.kaggle.com/c/titanic/data

¿Para que nos sirve cada uno de los imports que hacemos?

In [51]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

Bases de datos necesarias: *titanic_train y titanic_test*

In [52]:
df_train = pd.read_csv('titanic_train.csv', header = 0, dtype={'Age': np.float64})
df_test  = pd.read_csv('titanic_test.csv' , header = 0, dtype={'Age': np.float64})
df = pd.concat([df_train, df_test], ignore_index=True)

# Procesado de los datos

Recordemos primero los **problemas** con los que nos podemos encontrar en una base de datos:


1.   Valores Nan
2.   Valores categóricos

En el ejercicio que se presenta a contincuación será necesario enfrentarse a estas situaciones para poder pasar los datos correctos al algoritmo.
¿Cuáles son los distintos métodos que hemos trabajado para poder solventar estas situaciones?

## ¿Con que tipo de información vamos a trabajar?

A partir de la información subministrada por ***df.info()***; ¿Qué variables deben ser modificadas? ¿Porque razón? ¿ Qué métodos podemos emplear?

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 122.8+ KB

In [54]:
#Si queremos ver únicamente los primeros valores que hay en una base de datos ejecutamos:
df.head()
#Recordemos la importancia de visualizar la tabla, para poder ver de una manera clara como está estructurada la información

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [55]:
#¿Cuántas filas tiene nuestra base de datos?
df.shape[0]

1309

## Transformaciones

### Datos categóricos

Podemos hacer transformaciones binarias

**SEXO**

In [56]:
df['Sex'] = df['Sex'].map({'male': 0, 'female':1})

In [57]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

**TICKET**
Para transformar también debemos comprender los datos con los que trabajamos.

In [58]:
df['Ticket'].value_counts()

Ticket
CA. 2343        11
CA 2144          8
1601             8
PC 17608         7
S.O.C. 14879     7
                ..
113792           1
36209            1
323592           1
315089           1
359309           1
Name: count, Length: 929, dtype: int64

In [59]:
df['Ticket'] = df['Ticket'].map(lambda k: k[0])
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,P,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",1,26.0,0,0,S,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,1,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",0,35.0,0,0,3,8.0500,NaN,S

¿Que hace la siguiente función?¿Para qué nos puede servir?

In [60]:
def encode_label(df):
    return df.astype('category').cat.codes

In [61]:
df['Ticket'].value_counts()

Ticket
3    429
2    278
1    210
P     98
S     98
C     77
A     42
W     19
7     13
F     13
4     11
6      9
L      5
5      3
9      2
8      2
Name: count, dtype: int64

In [62]:
df['Ticket'] = df['Ticket'].replace(['A','W','F','L','5','6','7','8','9'], '4')
df['Ticket'].value_counts()

Ticket
3    429
2    278
1    210
4    119
P     98
S     98
C     77
Name: count, dtype: int64

In [63]:
df['Ticket'] = encode_label(df['Ticket'])

In [64]:
df['Ticket'].value_counts()

Ticket
2    429
1    278
0    210
3    119
5     98
6     98
4     77
Name: count, dtype: int64

In [65]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,3,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,5,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",1,26.0,0,0,6,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,0,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",0,35.0,0,0,2,8.0500,NaN,S

Mientras que en las situaciones numéricas como se ha visto anteriormente si que es posible resolver los valores que nos faltan mirando resultados comunes, en sitaciones categoricas es más distinto. Una situación por ejemplo a la que nos enfrentamos es la de la cabina.

In [66]:
df['Cabin'].isnull().sum(axis=0)

1014

In [67]:
#En este caso vamos a decantarnos por eliminar aquellas columnas sobrantes
df = df.drop(labels=['Cabin'], axis=1)

In [68]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,3,7.2500,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,5,71.2833,C
2,3,1.0,3,"Heikkinen, Miss. Laina",1,26.0,0,0,6,7.9250,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,0,53.1000,S
4,5,0.0,3,"Allen, Mr. William Henry",0,35.0,0,0,2,8.0500,S

**EMBARKED**

La variable **Embarked** nos indica el puerto en que nuestros pasajeros embarcaron

In [69]:
#Hay algún valor nulo?
df['Embarked'].isna().value_counts()

Embarked
False    1307
True        2
Name: count, dtype: int64

In [70]:
#¿Cuántos muestras de cada clase tenemos?
df['Embarked'].value_counts()

Embarked
S    914
C    270
Q    123
Name: count, dtype: int64

In [71]:
#Podemos plantear dos situaciones; podríamos llenar los huecos con el valor más común, dado que solo son 2 los valores que nos faltan. O podríamos eliminar estas filas.
#Emplea el método que más te guste.
df['Embarked'].fillna("S", inplace=True)

In [72]:
df['Embarked'].isna().value_counts()

Embarked
False    1309
Name: count, dtype: int64

In [73]:
#Finalmente; es importante tener en cuenta de que se trata de un valor categórico, razón por la cual debemos trasformarlo a una clase numérica. 0,1,2.
#Pista: anteriormente hemos definido una función que realiza esta tarea, úsala aquí también.
df['Embarked'] = encode_label(df['Embarked'])

In [74]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,3,7.2500,2
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,5,71.2833,0
2,3,1.0,3,"Heikkinen, Miss. Laina",1,26.0,0,0,6,7.9250,2
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,0,53.1000,2
4,5,0.0,3,"Allen, Mr. William Henry",0,35.0,0,0,2,8.0500,2

**NAME: NOMBRE**
¿Qué opciones tenemos con el nombre? 

Una variable como el nombre puede darnos mucha más información de la que pueda parecer a simple vista. Por ejemplo los títulos noviliarios suelen ser añadidos al nombre. Ante esta situación poemos extraer nuevos datos. A simple vista sinó el nombre en si no nos aporta información ya que es una variable única para cada pasajero

In [75]:
#¿Cómo está estructurado el nombre? ¿Dónde se encuentra la información que nos interesa?
df['Title'] = df['Name'].map(lambda z: z.split(",")[1].split(".")[0])
df['Title'].value_counts()

Title
 Mr              757
 Miss            260
 Mrs             197
 Master           61
 Rev               8
 Dr                8
 Col               4
 Mlle              2
 Major             2
 Ms                2
 Lady              1
 Sir               1
 Mme               1
 Don               1
 Capt              1
 the Countess      1
 Jonkheer          1
 Dona              1
Name: count, dtype: int64

In [76]:
#En el paso anterior nos hemos quedado con variables categóricas; ¿Cómo las transformamos a numéricas?
df['Title'] = encode_label(df['Title'])
df['Title'].value_counts()

Title
12    757
9     260
13    197
8      61
15      8
4       8
1       4
10      2
7       2
14      2
6       1
16      1
11      1
2       1
0       1
17      1
5       1
3       1
Name: count, dtype: int64

In [77]:
#El método presentado pordría ser una opción; sin embargo da lugar a muchas clases.
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title
0,1,0.0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,3,7.2500,2,12
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,5,71.2833,0,13
2,3,1.0,3,"Heikkinen, Miss. Laina",1,26.0,0,0,6,7.9250,2,9
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,0,53.1000,2,13
4,5,0.0,3,"Allen, Mr. William Henry",0,35.0,0,0,2,8.0500,2,12

In [78]:
#Otra opción sería clasificarlos por clases
def get_titles(df):
    title_dictionary = {
        "Capt": "Officer",
        "Col": "Officer",
        "Major": "Officer",
        "Jonkheer": "Royalty",
        "Don": "Royalty",
        "Dona": "Royalty",
        "Sir": "Royalty",
        "Dr": "Officer",
        "Rev": "Officer",
        "the Countess": "Royalty",
        "Mme": "Mrs",
        "Mlle": "Miss",
        "Ms": "Mrs",
        "Mr": "Mr",
        "Mrs": "Mrs",
        "Miss": "Miss",
        "Master": "Master",
        "Lady": "Royalty"
    }
    # print(df['Name'])

    def process_name(x):
        # print(x)
        return x.split(',')[1].split('.')[0].strip()

    df['Title'] = df['Name'].map(process_name)
    df['Title'] = df.Title.map(title_dictionary)
    # print(df['Name'][df['Title'].isna()])

    return df

In [79]:
#De esta manera nos quedamos únicamente con cinco grupos.
df = get_titles(df)
df['Title'] = df['Title'].map({'Officer': 0, 'Royalty': 1, 'Mrs': 2, 'Miss': 3, 'Master': 4, 'Mr': 5}).astype(int)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title
0,1,0.0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,3,7.2500,2,5
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,5,71.2833,0,2
2,3,1.0,3,"Heikkinen, Miss. Laina",1,26.0,0,0,6,7.9250,2,3
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,0,53.1000,2,2
4,5,0.0,3,"Allen, Mr. William Henry",0,35.0,0,0,2,8.0500,2,5

In [80]:
#Como hemos comentado anteriormente la variable nombre por si sola no nos interesa, por lo cual deberemos eliminarla
df.drop(labels=['Name'], axis=1, inplace=True)

In [81]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title
0,1,0.0,3,0,22.0,1,0,3,7.2500,2,5
1,2,1.0,1,1,38.0,1,0,5,71.2833,0,2
2,3,1.0,3,1,26.0,0,0,6,7.9250,2,3
3,4,1.0,1,1,35.0,1,0,0,53.1000,2,2
4,5,0.0,3,0,35.0,0,0,2,8.0500,2,5

### Datos numéricos

**FARE: TARIFA**


*   ¿Variable numérica o categórica?
*   Tenemos missing values? ¿Qué método puedo emplear para substituirlos?

In [82]:
# Tenemos valores numéricos?
df['Fare'].isna().value_counts()

Fare
False    1308
True        1
Name: count, dtype: int64

In [83]:
# ¿Cómo es la fila en la que me falta el valor?
na_fare = df[df['Fare'].isna()]
na_fare

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title
1043,1044,NaN,3,0,60.5,0,0,2,NaN,2,5

In [84]:
print(na_fare['Ticket'].values[0])

2

In [85]:
#En este caso particular se quiere emplear la media para poder llenar el hueco. Por elección individual, creo que Ticket, Pclass y Embarked son variables interesantes que
#definen el tipo de persona que adquiere ese ticket, por lo tanto su coste. Cual es el valor medio del ticket para aquellos pasajeros que cumplen las mismas condiciones
#que nosotros?
media = df['Fare'].loc[ (df['Ticket'] == na_fare['Ticket'].values[0]) & 
                            (df['Pclass'] == na_fare['Pclass'].values[0]) &
                            (df['Embarked'] == na_fare['Embarked'].values[0])].mean()
media

12.072079522184302

In [86]:
#Y si en lugar del valor medio usamos la mediana? ¿Cuál de los dos será mejor y porque?
guess_Fare = df['Fare'].loc[ (df['Ticket'] == na_fare['Ticket'].values[0]) & 
                            (df['Pclass'] == na_fare['Pclass'].values[0]) & 
                            (df['Embarked'] == na_fare['Embarked'].values[0])].median()
guess_Fare

8.05

In [87]:
#Llena los huecos con el valor que creas más conveniente
df['Fare'].fillna(guess_Fare , inplace=True)

In [88]:
#Comprobamos que no nos queden huecos
df['Fare'].isna().value_counts()

Fare
False    1309
Name: count, dtype: int64

Es cierto que hemos trabajado con valore categoricos en los que es imprescindible poder cambiarlos a clases numéricas, por ejemplo. Sin embargo hay situaciones en las que un rango de valores numéricos también es interesante poderlos transformar en clases de tal manera que tengamos agrupaciones.

In [89]:
#Puede observarse mediante un gráfico la distribución de los datos. ¿Qué información podemos extraer?¿Nos permite esta representación una división de los datos?
df.boxplot('Fare')

In [90]:
df['Fare'].describe()

count    1309.000000
mean       33.276193
std        51.743584
min         0.000000
25%         7.895800
50%        14.454200
75%        31.275000
max       512.329200
Name: Fare, dtype: float64

In [91]:
df['Fare-bin'] = pd.qcut(df.Fare,5,labels=[1,2,3,4,5]).astype(int)
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title,Fare-bin
0,1,0.0,3,0,22.0,1,0,3,7.2500,2,5,1
1,2,1.0,1,1,38.0,1,0,5,71.2833,0,2,5
2,3,1.0,3,1,26.0,0,0,6,7.9250,2,3,2
3,4,1.0,1,1,35.0,1,0,0,53.1000,2,2,5
4,5,0.0,3,0,35.0,0,0,2,8.0500,2,5,2

**PassengerID**

In [92]:
#¿Nos indica algo?¿Podemos eliminarla?
df.drop('PassengerId',axis= 1, inplace=True)

In [93]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title,Fare-bin
0,0.0,3,0,22.0,1,0,3,7.2500,2,5,1
1,1.0,1,1,38.0,1,0,5,71.2833,0,2,5
2,1.0,3,1,26.0,0,0,6,7.9250,2,3,2
3,1.0,1,1,35.0,1,0,0,53.1000,2,2,5
4,0.0,3,0,35.0,0,0,2,8.0500,2,5,2

**EDAD**

In [ ]:
#¿Tenemos valores nulos?
df['Age'].isna().value_counts()

Otra manera de llenar los huecos no es solo haciendo la media sino empleando un algortimo por si mismo para poder predecir estos valores nulos.

In [ ]:
# Importamos la clase RandomForestRegressor
from sklearn.ensemble import RandomForestRegressor

In [ ]:
#¿Qué variables nos interesan para tener en cuenta?
df_sub = df[['Age','Title','Fare','SibSp']]

In [ ]:
#Para poder entrenar el modelo y comprobar que funciona adecuadamente para aplicarlo a los datos desconocidos debemos:
# 1. eliminar aquellas filas nulas de los datos de entrenamiento
# 2. guardar en test las filas nulas.
X_train  = df_sub.dropna().drop('Age', axis=1)
y_train  = df['Age'].dropna()

X_test = df_sub.loc[np.isnan(df.Age)].drop('Age', axis=1)

In [ ]:
# Aplicamos el algortimo
# Para ello creamos una instancia de RandomForestRegresor 
regressor = RandomForestRegressor(n_estimators = 300)
# La función fit() nos permite entrenar el modelo, ajustados pesos dependiendo de los datos
regressor.fit(X_train, y_train)
# Una vez entrenado el modelo, este está listo para hacer predicciones, lo que se realiza mediante el método predict()
y_pred = np.round(regressor.predict(X_test),1)
y_pred

In [ ]:
# Sustituimos estos valores en el dataset
df.Age.loc[df.Age.isnull()] = y_pred

In [ ]:
# Comprobamos si nos quedan valores nulos o no
df.Age.isnull().sum(axis=0)

In [ ]:
df.head()

Como se ha comentado anteriormente, tener muchas clases distintas no nos favorece necesariamente. Ante esta situación podemos hacer grupos para poder reducir el número de clases, por ejemplo por rango de edades.

In [ ]:
df['Age-bin'] = df['Age']
df.loc[df['Age-bin'] <= 16, 'Age-bin'] = 0
df.loc[(df['Age-bin'] > 16) & (df['Age-bin'] <= 32), 'Age-bin'] = 1
df.loc[(df['Age-bin'] > 32), 'Age-bin'] = 2

Un aspecto a añadir pueden ser los **dummies** en los cuales en lugar de tener una columna donde aparecen múltiples clases tenemos una columna con cada una de las clases indicando si el elemento de esa fila pertence a la clase '1' o no '0'.

In [ ]:
df['FamilySize'] = df['Parch'] + df['SibSp'] + 1
df['Singleton'] = df['FamilySize'].map(lambda s: 1 if s == 1 else 0)
df['SmallFamily'] = df['FamilySize'].map(lambda s: 1 if 2 <= s <= 3 else 0)
df['MediumFamily'] = df['FamilySize'].map(lambda s: 1 if s == 4 else 0)
df['LargeFamily'] = df['FamilySize'].map(lambda s: 1 if 5 <= s else 0)

### Ahora ya tenemos nuestra base de datos lista, por el momento....

In [ ]:
df.head()

**Para pensar:**


1.   ¿Qué efecto tiene escoger de manera aleatoria el % de datos que van al entrenamiento (train) y a la prueba (test). ¿Cómo afecta nuestro resultado a la accuracy? ¿Qué nos está indicando de los datos?
2. ¿Cuáles son las variables que hemos de tratar para poder usar la base de datos?